CleanRoboCore/firmware_foc_stm32g4/Core/Src/drivers/pwm_driver.c
/*
 * pwm_driver.c
 *
 *  Created on: Aug 6, 2025
 *      Author: lapchong
 */

#include "stm32g4xx_hal.h"
#include "main.h"
#include "math.h"

// Define period if known, or get it dynamically
#define HRTIM_PERIOD 65280  // Adjust this to your actual period

void pwm_init() {
    // Start the outputs (you're enabling both outputs per timer - that's fine for complementary PWM)
//    HAL_HRTIM_WaveformOutputStart(&hhrtim1, HRTIM_OUTPUT_TA1 + HRTIM_OUTPUT_TA2
//                                  + HRTIM_OUTPUT_TC1 + HRTIM_OUTPUT_TC2
//                                  + HRTIM_OUTPUT_TD1 + HRTIM_OUTPUT_TD2);

	HAL_HRTIM_WaveformOutputStart(&hhrtim1,
	    HRTIM_OUTPUT_TA1 | HRTIM_OUTPUT_TA2 |
	    HRTIM_OUTPUT_TC1 | HRTIM_OUTPUT_TC2 |
	    HRTIM_OUTPUT_TD1 | HRTIM_OUTPUT_TD2);
	// Start the timers
    HAL_HRTIM_WaveformCounterStart(&hhrtim1, HRTIM_TIMERID_TIMER_A | HRTIM_TIMERID_TIMER_C | HRTIM_TIMERID_TIMER_D);
}

void pwm_write(uint32_t duty_a, uint32_t duty_b, uint32_t duty_c) {
	hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP1xR = duty_a;
	hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP1xR = duty_b;
	hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP1xR = duty_c;
}

#define PI_F       3.14159265f

void pwm_spin_test(void) {
    static float angle = 0.0f;
    const float step = 0.02f; // speed adjust

    uint32_t period = __HAL_HRTIM_GETPERIOD(&hhrtim1,
        HRTIM_TIMERINDEX_TIMER_A);

    float sa = sinf(angle), sb = sinf(angle - 2*PI_F/3), sc = sinf(angle + 2*PI_F/3);
    uint32_t da = (uint32_t)((sa*0.5f + 0.5f)*period);
    uint32_t db = (uint32_t)((sb*0.5f + 0.5f)*period);
    uint32_t dc = (uint32_t)((sc*0.5f + 0.5f)*period);

    pwm_write(da, db, dc);

    angle += step;
    if (angle >= 2*PI_F) angle -= 2*PI_F;
}

// Continuous PWM to maintain charge pump
void test_charge_pump_active(void) {
    uint32_t period = __HAL_HRTIM_GETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A);

    // 10% duty cycle on all three high-sides to get 2V output
    // Phase A high-side (10% duty = 2V)
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP1xR = period / 10;

    // Phase B high-side (10% duty = 2V)
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP1xR = period / 10;

    // Phase C high-side (10% duty = 2V)
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP1xR = period / 10;

    // All low-sides OFF for safety (all phases floating low through body diodes)
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP2xR = 0;
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP2xR = 0;
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP2xR = 0;
}

void test_charge_pump_rotation(void) {
    uint32_t period = __HAL_HRTIM_GETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A);
    uint32_t duty = period / 10;  // ~10% duty

    // Rotate test states with a static counter
    static uint8_t state = 0;

    // Clear all first for safety
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP1xR = 0; // A high
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP1xR = 0; // B high
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP1xR = 0; // C high

    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP2xR = 0; // A low
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP2xR = 0; // B low
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP2xR = 0; // C low

    switch (state) {
        case 0:
            // A-HS, B-HS, C-LS
            hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP1xR = duty;
            hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP1xR = duty;
            hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP2xR = duty;
            break;
        case 1:
            // B-HS, C-HS, A-LS
            hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP1xR = duty;
            hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP1xR = duty;
            hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP2xR = duty;
            break;
        case 2:
            // C-HS, A-HS, B-LS
            hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP1xR = duty;
            hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP1xR = duty;
            hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP2xR = duty;
            break;
        default:
            state = 0;
            return;
    }

    state++;
}

#define DUTY_MIN (0.05f)  // 5% minimum duty to keep bootstrap alive

float clamp_duty(float d) {
    if (d < DUTY_MIN) return DUTY_MIN;
    if (d > 1.0f - DUTY_MIN) return 1.0f - DUTY_MIN;
    return d;
}

void test_spin_high_voltage_6x_pwm_safe(void)
{
    static float angle = 0.0f;
    const float step = 0.02f;

    uint32_t period = __HAL_HRTIM_GETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A);

    float sa = sinf(angle);
    float sb = sinf(angle - 2 * PI_F / 3);
    float sc = sinf(angle + 2 * PI_F / 3);

    // Clamp high and low sides to ensure bootstrap refresh
    float ha_f = clamp_duty((sa * 0.5f + 0.5f));
    float la_f = clamp_duty((-sa * 0.5f + 0.5f));
    float hb_f = clamp_duty((sb * 0.5f + 0.5f));
    float lb_f = clamp_duty((-sb * 0.5f + 0.5f));
    float hc_f = clamp_duty((sc * 0.5f + 0.5f));
    float lc_f = clamp_duty((-sc * 0.5f + 0.5f));

    uint32_t ha = (uint32_t)(ha_f * period);
    uint32_t la = (uint32_t)(la_f * period);
    uint32_t hb = (uint32_t)(hb_f * period);
    uint32_t lb = (uint32_t)(lb_f * period);
    uint32_t hc = (uint32_t)(hc_f * period);
    uint32_t lc = (uint32_t)(lc_f * period);

    // Write duty values
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP1xR = ha;
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_A].CMP2xR = la;
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP1xR = hb;
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_C].CMP2xR = lb;
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP1xR = hc;
    hhrtim1.Instance->sTimerxRegs[HRTIM_TIMERINDEX_TIMER_D].CMP2xR = lc;

    // Step the angle
    angle += step;
    if (angle >= 2 * PI_F)
        angle -= 2 * PI_F;
}
